In [1]:
import pandas as pd
import numpy as np

In [2]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine

In [3]:
from sqlalchemy_utils import create_database, database_exists

###Load Title Data

In [4]:
df_basics = pd.read_csv('Data/title_basics.csv.gz')

In [5]:
df_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008,NaN,94,Horror

In [6]:
df_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87357 entries, 0 to 87356
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          87357 non-null  object
 1   titleType       87357 non-null  object
 2   primaryTitle    87357 non-null  object
 3   originalTitle   87357 non-null  object
 4   isAdult         87357 non-null  int64
 5   startYear       87357 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  87357 non-null  int64
 8   genres          87357 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 6.0+ MB

###Transform Title Data

In [7]:
## create a col with a list of genres
df_basics['genres_split'] = df_basics['genres'].str.split(',')

In [8]:
df_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008,NaN,94,Horror,[Horror]

In [9]:
exploded_genres = df_basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
87355,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Action
87355,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Adventure
87355,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
87356,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
87356,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [10]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

##Create a new table

In [11]:
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

In [12]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [13]:
exploded_genres.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama,Drama

###Create Title Genres Table

In [14]:
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [15]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0068865         7

In [16]:
#manually make dataframe with named cols from .keys and .values from genre_map
genres = pd.DataFrame({'Genre_Name': genre_map.keys(),
                      'Genre_ID': genre_map.values()})

In [17]:
df_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008,NaN,94,Horror,[Horror]

In [18]:
df_basics = df_basics.drop(columns=['originalTitle','isAdult','titleType','genres','genres_split'])

##Create Database

In [21]:
username = "root"
password = "root" 
db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [22]:
engine = create_engine(connection)

In [23]:
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [24]:
create_database(connection)

In [19]:
df_basics.dtypes

tconst             object
primaryTitle       object
startYear           int64
endYear           float64
runtimeMinutes      int64
dtype: object

In [20]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = df_basics['tconst'].fillna('').map(len).max()
title_len = df_basics['primaryTitle'].fillna('').map(len).max()
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [25]:
df_basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

87357

In [26]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

### Add Titles Table to Database

In [29]:
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [31]:
## Calculate max string lengths for object columns
tcon_len = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(tcon_len+1), 
    "genre_id": Integer()}

In [32]:
title_genres.to_sql('title_genres',engine,dtype=df_schema,if_exists='replace',index=False)

163502

In [33]:
df_titles = pd.read_csv('Data/title_ratings_url.csv.gz')

In [34]:
df_titles.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000005            6.2      2678
3  tt0000006            5.0       183
4  tt0000007            5.4       839

In [35]:
df_titles.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [36]:
## Calculate max string lengths for object columns
const_len = df_titles['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(const_len+1), 
    "averageRating": Float(),
    "numVotes": Integer()}

In [37]:
df_titles.to_sql('title_ratings',engine,dtype=df_schema,if_exists='replace',index=False)

512070

In [38]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

### Import TMDB Data

In [39]:
df_tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz')

In [40]:
df_tmdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.450,10.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.101,2369.0,PG

In [41]:
tmdb_data = df_tmdb.loc[:, ['imdb_id', 'revenue', 'budget', 'certification']]

In [42]:
tmdb_data.dtypes

imdb_id           object
revenue          float64
budget           float64
certification     object
dtype: object

In [43]:
## Calculate max string lengths for object columns
imdb_len = df_tmdb['imdb_id'].fillna('').map(len).max()
cert_len = df_tmdb['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(imdb_len+1), 
    "budget" : Float(),
    "revenue" : Float(),
    "certification" : String(cert_len+1)}

### Add TMDB Table to SQL

In [44]:
df_tmdb.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)

2625

### ADD Genres Table to SQL

In [50]:
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Genre_Name  25 non-null     object
 1   Genre_ID    25 non-null     int64
dtypes: int64(1), object(1)
memory usage: 532.0+ bytes

In [ ]:
## Calculate max string lengths for object columns
genre_len = genres['Genre_Name'].fillna('').map(len).max()
df_schema = {
    "Genre_Name": Text(genre_len+1),
    'Genre_ID':Integer()}

In [53]:
genres.to_sql('genres',engine,dtype=df_schema,if_exists='replace',index=False)

25

## View Tables in SQL

In [54]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

In [46]:
q = """SELECT *
FROM title_basics
LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0068865,Lives of Performers,2016.0,None,90
3,tt0069049,The Other Side of the Wind,2018.0,None,122
4,tt0082328,Embodiment of Evil,2008.0,None,94

In [47]:
q2 = """SELECT *
FROM title_genres
LIMIT 5;"""
pd.read_sql(q2, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0068865         7

In [48]:
q3 = """SELECT *
FROM title_ratings
LIMIT 5;"""
pd.read_sql(q3, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000005            6.2      2678
3  tt0000006            5.0       183
4  tt0000007            5.4       839

In [49]:
q4 = """SELECT *
FROM title_ratings
LIMIT 5;"""
pd.read_sql(q4, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000005            6.2      2678
3  tt0000006            5.0       183
4  tt0000007            5.4       839

In [55]:
q5 = """SELECT *
FROM genres
LIMIT 5;"""
pd.read_sql(q5, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4